package activityPanel;

import sql.SQL_Area;
import sql.SQL_Math;

import javax.swing.*;
import java.sql.SQLException;
import java.util.HashMap;

public class SimulationPanel extends JPanel {


    private int totalPopulation = 51672400;

    public SimulationPanel() throws SQLException {
        test(4,4,2,0);
    }

    private void test(int google,int view,int sub,int ratio) throws SQLException {
        //인물별로 비율 계산 결과
        //{유승민=5, 원희룡=1, 심상정=7, 홍준표=14, 허경영=8, 김두관=1, 윤석열=9, 이재명=22, 이낙연=13, 정세균=3, 최재형=4, 안철수=6}
        HashMap percent_foreach_Hashmap = new SQL_Math(google,view,sub,ratio).getHashMap();
        System.out.println(percent_foreach_Hashmap);

        //지역별로 총 인물별 득표율
        //{울산광역시={유승민=78846, 원희룡=0, 심상정=22527, 홍준표=214010, 허경영=146428, 김두관=45055, 윤석열=123901, 이재명=281592, 이낙연=135164, 정세균=45055, 안철수=123901, 최재형=67582}, 대전광역시={유승민=58244, 원희룡=0, 심상정=101927, 홍준표=276660, 허경영=87366, 김두관=0, 윤석열=174733, 이재명=334905, 이낙연=189294, 정세균=72805, 안철수=101927, 최재형=101927}, 광주광역시={유승민=115412, 원희룡=0, 심상정=72132, 홍준표=245250, 허경영=115412, 김두관=0, 윤석열=158691, 이재명=360662, 이낙연=245250, 정세균=100985, 안철수=72132, 최재형=28853}, 전라남도={유승민=92046, 원희룡=0, 심상정=92046, 홍준표=276138, 허경영=184092, 김두관=110455, 윤석열=184092, 이재명=441821, 이낙연=331366, 정세균=73637, 안철수=92046, 최재형=36818}, 부산광역시={유승민=336436, 원희룡=0, 심상정=67287, 홍준표=605584, 허경영=336436, 김두관=134574, 윤석열=471010, 이재명=841090, 이낙연=538297, 정세균=235505, 안철수=201861, 최재형=201861}, 경상남도={유승민=232809, 원희룡=0, 심상정=133034, 홍준표=598651, 허경영=332584, 김두관=33258, 윤석열=399101, 이재명=798202, 이낙연=432359, 정세균=199550, 안철수=199550, 최재형=199550}, 경기도={유승민=1080055, 원희룡=0, 심상정=1350069, 홍준표=2295117, 허경영=1080055, 김두관=0, 윤석열=1620083, 이재명=3510179, 이낙연=2025103, 정세균=675034, 안철수=945048, 최재형=675034}, 전라북도={유승민=125604, 원희룡=0, 심상정=179435, 홍준표=269152, 허경영=125604, 김두관=17943, 윤석열=179435, 이재명=394756, 이낙연=305039, 정세균=143548, 안철수=125604, 최재형=53830}, 대구광역시={유승민=167835, 원희룡=0, 심상정=143859, 홍준표=455553, 허경영=215788, 김두관=0, 윤석열=311694, 이재명=623388, 이낙연=407600, 정세균=167835, 안철수=143859, 최재형=143859}, 서울특별시={유승민=669619, 원희룡=0, 심상정=1147919, 홍준표=1721878, 허경영=1052259, 김두관=191320, 윤석열=1339239, 이재명=2487157, 이낙연=1721878, 정세균=669619, 안철수=860939, 최재형=765279}, 충청남도={유승민=84696, 원희룡=0, 심상정=127044, 홍준표=338784, 허경영=169392, 김두관=0, 윤석열=254088, 이재명=508176, 이낙연=338784, 정세균=105870, 안철수=127044, 최재형=105870}, 충청북도={유승민=159750, 원희룡=0, 심상정=79875, 홍준표=255600, 허경영=127800, 김두관=31950, 윤석열=191700, 이재명=367426, 이낙연=255600, 정세균=47925, 안철수=111825, 최재형=0}, 제주특별자치도={유승민=40518, 원희룡=40518, 심상정=13506, 홍준표=74282, 허경영=40518, 김두관=0, 윤석열=74282, 이재명=162070, 이낙연=87788, 정세균=33765, 안철수=40518, 최재형=60776}, 강원도={유승민=92132, 원희룡=0, 심상정=122842, 홍준표=276395, 허경영=153553, 김두관=76777, 윤석열=199619, 이재명=414593, 이낙연=245685, 정세균=15355, 안철수=107487, 최재형=107487}, 경상북도={유승민=236916, 원희룡=0, 심상정=52648, 홍준표=394860, 허경영=236916, 김두관=0, 윤석열=342212, 이재명=658100, 이낙연=315888, 정세균=78972, 안철수=236916, 최재형=157944}, 인천광역시={유승민=117455, 원희룡=0, 심상정=176182, 홍준표=440455, 허경영=205546, 김두관=146818, 윤석열=352364, 이재명=734092, 이낙연=440455, 정세균=176182, 안철수=146818, 최재형=234909}}
        HashMap totalHashmap = new SQL_Area(percent_foreach_Hashmap).getHashMap();
        System.out.println(totalHashmap);


        //결과
//      //{유승민=3688373, 원희룡=40518, 심상정=3882332, 홍준표=8738369, 허경영=4609749, 김두관=788150, 윤석열=6376244, 이재명=12918209, 이낙연=8015550, 정세균=2841642, 안철수=3637475, 최재형=2941579}
        HashMap <String, Integer>  rankHashMap = new SQL_Area(percent_foreach_Hashmap).getRankHashMap();
        System.out.println(rankHashMap);

//      100%에서 각각의 %로 환산 비율
        for( String key : rankHashMap.keySet() ){
            System.out.print(key+" ");
            System.out.println(Math.round((double) rankHashMap.get(key)/totalPopulation*100));
        }
    }
}
